Repository: pypi-data/pypi-mirror-198
Catalog: packages/friendly/friendly-0.7.21.tar.gz/friendly-0.7.21/friendly/locales/*/LC_MESSAGES/friendly_*.po
Languages: ru

source: The file {filename} does not exist.
ru: Файл {filename} не найден.

source: Type 'Friendly' for basic help.
ru: Напечатайте 'Friendly' для получения базовой помощи.

source: Do you find these warnings useful? Comment at https://github.com/friendly-traceback/friendly-traceback/issues/7. You can use www('warnings') to go to that url.
ru: Вы считаете эти предупреждения полезными? Оставляйте комментарии на https://github.com/friendly-traceback/friendly-traceback/issues/7. Вы можете использовать www('warnings') для перехода по этому адресу.

source: Warning: you added a type hint to the python builtin `{name}`.
ru: Warning: вы добавили подсказку типа для встроенного модуля Python `{name}`.

source: Warning: you used a type hint for a variable without assigning it a value.
ru: Warning: вы использовали подсказку типа для переменной, не присвоив той значения.

source: Instead of `{hint}`, perhaps you meant `{assignment}`.
ru: Вместо `{hint}` вы, возможно, имели в виду `{assignment}`.

source: Warning: you have redefined the python builtin `{name}`.
ru: Warning: вы переопределили встроенный модуль Python `{name}`.

source: Friendly cannot be installed in this version of IDLE.
ru: Friendly не может быть установлена в этой версии IDLE.

source: Using Friendly's own console instead.
ru: Вместо этого используется собственная консоль Friendly.

source: Sets the width of the traceback.
ru: Задает ширину стека трассировки.

source: set_width() is only available using 'day', 'night' or 'colourful' mode.
ru: set_width() доступна только в режимах 'day', 'night', 'colourful'.

source: Colour scheme designed for Mu's day theme.
ru: Цветовая схема для дневной темы Mu.

source: Colour scheme designed for Mu's night theme.
ru: Цветовая схема для ночной темы Mu.

source: Colourful scheme with black background suitable for Mu's high contrast theme.
ru: Цветовая схема с черным фоном подходит для высококонтрастной темы Mu.

source: White text on black background; suitable for Mu's high contrast theme.
ru: Белый текст на черном фоне; подходит для высококонтрастной темы Mu.

source: Friendly themes are only available in Mu's REPL.
ru: Friendly themes доступны только в REPL Mu.

source: Sets a colour scheme designed for a black background.
ru: Устанавливает цветовую схему, предназначенную для черного фона.

source: Sets a colour scheme designed for a white background.
ru: Устанавливает цветовую схему, предназначенную для белого фона.

source: Plain formatting, with no colours added.
ru: Обычное форматирование, без раскраски.

source: Sets the background color.
ru: Устанавливает цвет фона.

source: Sets the output width in some modes.
ru: Устанавливает ширину вывода в некоторых режимах.

source: Prints the saved settings.
ru: Выводит сохранённые настройки.

source: Hide
ru: Скрыть

source: More ...
ru: Больше ...

source: Show message only
ru: Показать только сообщение

source: Invalid color {color}. Colors must be of the form #dddddd.
ru: Некорректный цвет {color}. Цвет должен быть следующего формата: #dddddd.
