Repository: pypi-data/pypi-mirror-198
Catalog: packages/friendly/friendly-0.7.21-py3-none-any.whl/friendly/locales/*/LC_MESSAGES/friendly_*.po
Languages: es

source: The file {filename} does not exist.
es: El archivo {filename} no existe.

source: Type 'Friendly' for basic help.
es: Escriba 'Friendly' para obtener ayuda sobre funciones/métodos especiales.

source: Warning: you added a type hint to the python builtin `{name}`.
es: Advertencia: agregaste un indicador de tipo al objeto incorporado de python `{name}`.

source: Warning: you used a type hint for a variable without assigning it a value.
es: Advertencia: usaste un indicador de tipo para una variable sin asignarle un valor.

source: Instead of `{hint}`, perhaps you meant `{assignment}`.
es: En lugar de `{hint}`, quizás quisiste decir `{assignment}`.

source: Warning: you have redefined the python builtin `{name}`.
es: Advertencia: redefiniste el objeto incorporado de python `{name}`.

source: Sets the width of the traceback.
es: Establece la anchura del rastreo.

source: set_width() is only available using 'day', 'night' or 'colourful' mode.
es: set_width() sólo está disponible en modo "day", "night" o "colourful".

source: Colour scheme designed for Mu's day theme.
es: Combinación de colores diseñada para el tema 'día' de Mu.

source: Colour scheme designed for Mu's night theme.
es: Combinación de colores diseñada para el tema 'noche' de Mu.

source: Colourful scheme with black background suitable for Mu's high contrast theme.
es: Esquema colorido con fondo negro adecuado para el tema de alto contraste de Mu.

source: White text on black background; suitable for Mu's high contrast theme.
es: Texto blanco sobre fondo negro; adecuado para el tema de alto contraste de Mu.

source: Friendly themes are only available in Mu's REPL.
es: Los temas amigables sólo están disponibles en el REPL de Mu.

source: Sets a colour scheme designed for a black background.
es: Establece un esquema de color diseñado para un fondo negro.

source: Sets a colour scheme designed for a white background.
es: Establece una combinación de colores diseñada para un fondo blanco.

source: Plain formatting, with no colours added.
es: Formato simple, sin colores añadidos.

source: Sets the background color.
es: Establece el color de fondo.

source: Sets the output width in some modes.
es: Establece el ancho de la salida en algunos modos.

source: Hide
es: Ocultar

source: More ...
es: Más ...

source: Show message only
es: Mostrar sólo el mensaje

source: Invalid color {color}. Colors must be of the form #dddddd.
es: Color {color} no válido. Los colores deben ser en la forma #dddddd.
